In [ ]:
# import necessary packages here
import warnings
warnings.filterwarnings('ignore')

1. Load the pandas library, and alias it so you can use `pd` instead of typing `pandas` each time you need to access the package.

2. Load the penguin and titanic datasets from GitHub. Store them in `penguins` and `titanic` respectively.

`
penguin_url = 'https://raw.githubusercontent.com/cmparlettpelleriti/CPSC392ParlettPelleriti/master/Data/penguins.csv'
titanic_url = 'https://raw.githubusercontent.com/mwaskom/seaborn-data/master/titanic.csv'
print("done")
`

3. Print the head (first 5 or 6 rows) of each data set.

4. Store the sex column from the titanic dataset in the variable `sex`. Print it.

5. Store the 10th row from the penguin dataset in the variable `penguins_10`. Print it.

6. Grab the age of the 12th person in the titanic dataset and store it in the variable `passenger12`. Print it.

7. Store the mean age of titanic passengers in the variable `mean_age`, print it.

8. Create a new column in `penguins` called `bill_ratio` for the penguin dataset that contains the ratio of bill length to bill depth (in otherwords bill length divided by bill depth). Print out this column.

9. Create a new data frame called `lil_boys` that only contains penguins that have a body mass less than 400 grams. Print the first 4 rows of this dataframe.

10. What is the mean bill length for each species of penguin? Store the means in the variables `bl_Adelie`, `bl_Chinstrap` and `bl_Gentoo` respectively. Print them out.

11. Which class from the titanic dataset had the highest proportion of surviors? Print out the proportion of people who survived for each class.

12. Is there a difference in the average fare paid between males and females in the titanic dataset? Use pandas to find your answer.

13. Create a dataframe called `small_penguin` that has all the rows from `penguins` but only the columns `bill_length_mm` ,`bill_depth_mm` , `flipper_length_mm` , and `body_mass_g`

In [7]:
### YOUR CODE HERE ###
#1
import pandas as pd

In [8]:
#2
penguin_url = 'https://raw.githubusercontent.com/cmparlettpelleriti/CPSC392ParlettPelleriti/master/Data/penguins.csv'
titanic_url = 'https://raw.githubusercontent.com/mwaskom/seaborn-data/master/titanic.csv'
DF1 = pd.read_csv(penguin_url)
DF2 = pd.read_csv(titanic_url)

print("done")

done

In [11]:
#3
DF1.head()

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year
0,0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007
1,1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007
2,2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007
3,3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007
4,4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007

In [12]:
DF2.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [13]:
#4
sex = DF2["sex"]
sex

0        male
1      female
2      female
3      female
4        male
        ...
886      male
887    female
888    female
889      male
890      male
Name: sex, Length: 891, dtype: object

In [36]:
#5
penguins_10 = DF1.iloc[9]
penguins_10

Unnamed: 0                   9
species                 Adelie
island               Torgersen
bill_length_mm              42
bill_depth_mm             20.2
flipper_length_mm          190
body_mass_g               4250
sex                        NaN
year                      2007
bill_ratio             2.07921
Name: 9, dtype: object

In [37]:
#6
passenger12 = DF2.iloc[11]["age"]
passenger12

58.0

In [22]:
#7
mean_age = DF2["age"].mean()
mean_age

29.69911764705882

In [25]:
#8
DF1["bill_ratio"] = DF1["bill_length_mm"]/DF1["bill_depth_mm"]
DF1.head()

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year,bill_ratio
0,0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007,2.090909
1,1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007,2.270115
2,2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007,2.238889
3,3,Adelie,Torgersen,NaN,NaN,NaN,NaN,NaN,2007,NaN
4,4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007,1.901554

In [32]:
#9
littleBoys = DF1["body_mass_g"] < 4000
lil_boys = DF1.loc[littleBoys]
lil_boys.head()
# DF1["body_mass_g"].describe()

,Unnamed: 0,species,island,bill_length_mm,bill_depth_mm,flipper_length_mm,body_mass_g,sex,year,bill_ratio
0,0,Adelie,Torgersen,39.1,18.7,181.0,3750.0,male,2007,2.090909
1,1,Adelie,Torgersen,39.5,17.4,186.0,3800.0,female,2007,2.270115
2,2,Adelie,Torgersen,40.3,18.0,195.0,3250.0,female,2007,2.238889
4,4,Adelie,Torgersen,36.7,19.3,193.0,3450.0,female,2007,1.901554
5,5,Adelie,Torgersen,39.3,20.6,190.0,3650.0,male,2007,1.907767

In [46]:
#10
adelie = DF1["species"] == "Adelie"
bl_Adelie = DF1.loc[adelie]["bill_length_mm"].mean()
print(bl_Adelie)

bl_Chinstrap = DF1.loc[DF1["species"] == "Chinstrap"]["bill_length_mm"].mean()
print(bl_Chinstrap)
bl_Gentoo = DF1.loc[DF1["species"] == "Gentoo"]["bill_length_mm"].mean()
print(bl_Gentoo)

38.79139072847684
48.83382352941177
47.504878048780476

In [57]:
class1 = DF2.loc[DF2["class"] == "First"]
firstSurvive = class1.loc[class1["alive"] == "yes"]
firstClass = len(firstSurvive)/(len(class1))
print(firstClass)
class2 = DF2.loc[DF2["class"] == "Second"]
secondSurvive = class2.loc[class2["alive"] == "yes"]
secondClass = len(secondSurvive)/(len(class2))
print(secondClass)

class3 = DF2.loc[DF2["class"] == "Third"]
thirdSurvive = class3.loc[class3["alive"] == "yes"]
thirdClass = len(thirdSurvive)/(len(class3))
print(thirdClass)

0.6296296296296297
0.47282608695652173
0.24236252545824846

In [61]:
males = DF2.loc[DF2["sex"] == "male"]["fare"].mean()
print(males)
females = DF2.loc[DF2["sex"] == "female"]["fare"].mean()
females

25.523893414211418

44.47981783439487

In [63]:
small_penguin = DF1["bill_length_mm"]
small_penguin["bill_depth_mm"] = DF1["bill_depth_mm"]

/usr/lib/python3.7/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy